go.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-24 Fri 12:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Go</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Go</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcb4ee90">print</a></li>
<li><a href="#org8c638e7">time</a></li>
<li><a href="#org0274fea">sync</a></li>
<li><a href="#orgcaf33d9">go</a></li>
<li><a href="#org95c8561">chan</a></li>
<li><a href="#org62d973a">context</a></li>
<li><a href="#orgb3d6c73">gonum</a>
<ul>
<li><a href="#org1936127">Test example</a></li>
<li><a href="#org9215b06">NewDense</a></li>
<li><a href="#org1866351">make</a></li>
<li><a href="#org8ea016e">gonum execute</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgcb4ee90" class="outline-2">
<h2 id="orgcb4ee90">print</h2>
<div class="outline-text-2" id="text-orgcb4ee90">
<div class="org-src-container">
<pre class="src src-go">package main
import "fmt"
func main() {
    a := [...]int{1,2,3,4,5}
    b := a
    b[1] = 50
    fmt.Println(a)
    fmt.Println(b)
}
</pre>
</div>

<pre class="example">
[1 2 3 4 5]
[1 50 3 4 5]

</pre>
</div>
</div>

<div id="outline-container-org8c638e7" class="outline-2">
<h2 id="org8c638e7">time</h2>
<div class="outline-text-2" id="text-org8c638e7">
<div class="org-src-container">
<pre class="src src-go">package main
import (
    "fmt"
    "time"
)
func test() {
    start := time.Now()
    sum := 0
    for i := 0; i &lt; 100000; i++ {
	sum++
    }
    elapsed := time.Since(start)
    fmt.Println("该函数执行完成耗时：", elapsed)
}

func main() {
    test()
}

</pre>
</div>

<pre class="example">
该函数执行完成耗时： 33.536µs

</pre>
</div>
</div>

<div id="outline-container-org0274fea" class="outline-2">
<h2 id="org0274fea">sync</h2>
<div class="outline-text-2" id="text-org0274fea">
<div class="org-src-container">
<pre class="src src-go">package main
import (
    "fmt"
    "time"
    "sync"
)
func main() {
    var wg sync.WaitGroup
    wg.Add(1)

    go func(){
	count("Sleep")
	wg.Done()
    }()
    wg.Wait()
}

func count(thing string) {
    for i := 1; i &lt;= 5; i++ {
	fmt.Println(i, thing)
	time.Sleep(time.Millisecond*500)
    }

}
</pre>
</div>

<pre class="example">
1 Sleep
2 Sleep
3 Sleep
4 Sleep
5 Sleep

</pre>
</div>
</div>

<div id="outline-container-orgcaf33d9" class="outline-2">
<h2 id="orgcaf33d9">go</h2>
<div class="outline-text-2" id="text-orgcaf33d9">
<div class="org-src-container">
<pre class="src src-go">package main
import (
    "fmt"
    "time"
)
func main() {
    var times int
    go func() {
	for {
	}
    }()
    go func() {
	for {
	}
    }()
    go func() {
	for {
	}
    }()
    go func() {
	for {
	}
    }()
    for times = 0; times &lt;= 10; times++ {
	fmt.Println("tick", times)
	time.Sleep(time.Second)
    }
}

</pre>
</div>

<pre class="example">
tick 0
tick 1
tick 2
tick 3
tick 4
tick 5
tick 6
tick 7
tick 8
tick 9
tick 10
</pre>
</div>
</div>

<div id="outline-container-org95c8561" class="outline-2">
<h2 id="org95c8561">chan</h2>
<div class="outline-text-2" id="text-org95c8561">
<div class="org-src-container">
<pre class="src src-go">package main
import "fmt"
func main() {
    // 创建一个整型带两个缓冲的通道
    ch := make(chan int, 2)

    // 给通道放入两个数据
    ch &lt;- 0
    ch &lt;- 1

    // 关闭缓冲
    close(ch)
    // 遍历缓冲所有数据, 且多遍历1个
    for i := 0; i &lt; cap(ch)+1; i++ {

	// 从通道中取出数据
	v, ok := &lt;-ch

	// 打印取出数据的状态
	fmt.Println(v, ok)
    }
}
</pre>
</div>

<pre class="example">
0 true
1 true
0 false

</pre>
</div>
</div>

<div id="outline-container-org62d973a" class="outline-2">
<h2 id="org62d973a"><a id="ID-2bf1c325-6a98-43be-815c-a41934b02756"></a>context</h2>
<div class="outline-text-2" id="text-org62d973a">
<div class="org-src-container">
<pre class="src src-go">package main

import (
    "fmt"
    "context"
    "time"
)

func enrichContext(ctx context.Context) context.Context {
    return context.WithValue(ctx, "request-id", "11212")

}

func doSomething(ctx context.Context){
    rID := ctx.Value("request-id")
    fmt.Println(rID)
    for {
	select {
	case &lt;-ctx.Done():
	    fmt.Println("times out")
	    return
	default:
	    fmt.Println("doing something cool")
	}
	time.Sleep(500*time.Millisecond)
    }
}


func main (){
    fmt.Println("Go Context example")
    ctx, cancel := context.WithTimeout(context.Background(), 2*time.Second)
    defer cancel()
    fmt.Println(ctx.Err())
    ctx = enrichContext(ctx)
    go doSomething(ctx)
    select {
    case &lt;- ctx.Done():
	fmt.Println("Oh, no, Time is execeed the deadline")
	fmt.Println(ctx.Err())
    }
    time.Sleep(2*time.Second)
}
</pre>
</div>

<pre class="example">
Go Context example
&lt;nil&gt;
11212
doing something cool
doing something cool
doing something cool
doing something cool
Oh, no, Time is execeed the deadline
context deadline exceeded
times out
</pre>
</div>
</div>

<div id="outline-container-orgb3d6c73" class="outline-2">
<h2 id="orgb3d6c73">gonum</h2>
<div class="outline-text-2" id="text-orgb3d6c73">
</div>
<div id="outline-container-org1936127" class="outline-3">
<h3 id="org1936127">Test example</h3>
<div class="outline-text-3" id="text-org1936127">
<div class="org-src-container">
<pre class="src src-go">package main

import (
	"fmt"

	"gonum.org/v1/gonum/blas/blas64"
	"gonum.org/v1/gonum/mat"
)

func main() {
	r := row{1, 2, 3, 4}
	c := column{1, 2, 3}

	var m mat.Dense
	m.Mul(c, r)

	fmt.Println(mat.Formatted(&amp;m))
	n := c.RawVector().N
	inc := c.RawVector().Inc
	d := c.RawVector().Data
	fmt.Println(n)
	fmt.Println(inc)
	fmt.Println(d)

	u := mat.NewVecDense(3, []float64{1, 2, 3})
	v := mat.NewVecDense(3, []float64{4, 5, 6})
	fmt.Println("u :", u)
	fmt.Println("v :", v)

}

// row is a user-defined row vector.
type row []float64

// Dims, At and T minimally satisfy the mat.Matrix interface.
func (v row) Dims() (r, c int)    { return 1, len(v) }
func (v row) At(_, j int) float64 { return v[j] }
func (v row) T() mat.Matrix       { return column(v) }

// RawVector allows fast path computation with the vector.
func (v row) RawVector() blas64.Vector {
	return blas64.Vector{N: len(v), Data: v, Inc: 1}
}

// column is a user-defined column vector.
type column []float64

// Dims, At and T minimally satisfy the mat.Matrix interface.
func (v column) Dims() (r, c int)    { return len(v), 1 }
func (v column) At(i, _ int) float64 { return v[i] }
func (v column) T() mat.Matrix       { return row(v) }

// RawVector allows fast path computation with the vector.
func (v column) RawVector() blas64.Vector {
	return blas64.Vector{N: len(v), Data: v, Inc: 1}
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org9215b06" class="outline-3">
<h3 id="org9215b06">NewDense</h3>
<div class="outline-text-3" id="text-org9215b06">
<div class="org-src-container">
<pre class="src src-go">package main

import (
	"fmt"
	"gonum.org/v1/gonum/mat"
)

func main() {
	zeros := mat.NewDense(3,5,nil)
	fmt.Println(zeros)
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org1866351" class="outline-3">
<h3 id="org1866351">make</h3>
<div class="outline-text-3" id="text-org1866351">
<div class="org-src-container">
<pre class="src src-go">package main

import (
	"fmt"
	"math/rand"
	"gonum.org/v1/gonum/mat"
)

func main() {
	data := make([]float64, 36)
	for i := range data {
		data[i] = rand.NormFloat64()
	}
	a := mat.NewDense(6, 6, data)
	zeros := mat.NewDense(3,5,nil)
	// fmt.Println(mat.Formatted(zeros, mat.Prefix(""), mat.Squeeze()))
	// fmt.Println(mat.Formatted(a, mat.Prefix(""), mat.Squeeze()))
	eq := mat.Equal(a, zeros)
	fmt.Println(eq)

}

</pre>
</div>
</div>
</div>

<div id="outline-container-org8ea016e" class="outline-3">
<h3 id="org8ea016e">gonum execute</h3>
<div class="outline-text-3" id="text-org8ea016e">
<div class="org-src-container">
<pre class="src src-sh"><span style="font-weight: bold;">cd</span> babel
go mod init babel-go
go mod tidy
go build main.go
rm main.go
rm go.mod
rm go.sum
./main
</pre>
</div>

<pre class="example">
false

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-06-24 Fri 12:04</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
